// Начало урока пояснения смысла переменной
// =-=======================================================
// let num1 = 34
// let num2 = 31
// let sum = num1 + num2

// alert(sum)
// sum = sum + sum
// alert(sum + num2)

// alert(34 + 31)
// alert(34 + 31 + 34 + 31)


// Второй этап урока 
// =================================================
// + суммирование (но у него есть способность суммировать всё)
// - вычитание это оператор вычитание его суть отнимать 
// / деление 
// * умножение 
// % оператор деления с отстатком 

// alert(10+5+" сумирование")  
// alert(10-5+" вычитание")  
// alert(10/5+" деление")   
// alert(10*5+" умножение")  
// alert(10%5+" деление с остатком")  

// Пояснение как работает оператор деления с остатком с примером
// Оператор деление с остатком находит ближайшее подходящее значение от делимого числа 
//  Которое не превышает значение от делимого числа
//  и производит операцию вычитания после чего выводит ответ данной операции
// Пример работы
// 10 % 2 = 0
// 1) 2 + 2 + 2 + 2 + 2 Оператор деление с остатком находит ближайшее число по значению от первого
// 2) 10 - 10 = 0 Оператор деления с остатком производит операцию вычитания и выводит ответ ноль

// () это оператор разделения логики

// alert(10+5*2) 
// здесь мы получили значение 20 
// в общих скобках сначала умножение потом сумирование 
// итог суммы 20
// alert((10 + 5) * 2)  что бы получить значение 30 мы вкладываем значение (10+5)
// а потом дулаем общие скобки для умножения и получаем ((10 + 5) * 2) 
// итог суммы 30
// каждый язык программирования работает по  математическим законам 

// Практика

// let num1 = 20
// alert(20*2)
// alert(20/3)
// alert(20-5)
// alert(20+10)

// let num2 = 40
// let num3 = 6.666666666666667
// let num4 = 15
// let num5 = 30
// alert(num2+num3+num4+num5)  //91.66666666667

// let nym1 = 144
// alert(144*2)
// alert(144/3)
// alert(144-5)
// alert(144+10)

// let num2 = 288
// let num3 = 48
// let num4 = 139
// let num5 = 154

// let a = num2+num3+num4+num5  // 629

// alert(a)

// Пример решения
// let num = 20
// let uma = num * 2
// let del = num / 3
// let raz = num - 5
// let sum = num + 10

// let answ = uma + del + raz + sum

// alert(answ)



// let num = prompt()
// alert(num)

// Третий этап Типы данных
// =====================================================================================================

// 1. Целочисленное - целое число без остатка
// 2. Дробнное - значение имеет остаток
// 3. Строчное - слово или предложение ( символ из  клавиатуры)
// 4. Логический - только 2 значение (true) (false) правда или ложь

// let bat = 5
// let bat1 =5.67
// let bat2 = "5"
// let bat3 = true

// alert (bat+bat2)


// Четвёртый этап  практика

// let num1 = parseInt(prompt('Введите число'))
// let num2 = parseInt(prompt('Введите число'))
// let num3 = parseInt(prompt('Введите число'))

// let sum = num1 + num2 + num3
// let uma = num1 * num2 *  num3
// let arif = sum / 3

// alert ("Сумма чискл " + sum + "\n" +

// "Умножение " + uma + "\n" +
// "Средне Арифметическое " + arif

// )

